//1Tapsrma;kankylatr

let log1 = prompt("1san engizy")
let log2 = prompt("2 san engizy")

   if (log1,log2) {
    alert(log1+log2)
    alert(log1-log2)
    alert(log1*log2)
    alert(log1/log2)

}




// 1. Тапсырма: Қарапайым калькулятор
// Пайдаланушыдан екі санды енгізу арқылы төрт негізгі математикалық операцияны орындау: қосу, алу, көбейту және бөлу.
// Тапсырманың талаптары:
// Пайдаланушыдан екі санды енгізуді сұрау.
// Егер пайдаланушы сан енгізбесе немесе дұрыс сан енгізбесе, "Қате енгізу!" деген хабарлама шығару.
// Қосындыны, айырманы, көбейтіндіні және бөліндіні есептеу.
// Қосымша талаптар:
// Пайдаланушыға дұрыс емес енгізулерді қайталауға мүмкіндік беру.
// Нәтижені экранға шығару
// 2. Тапсырма: Супермаркеттің жеңілдіктері
//    Қолданушыдан заттың бағасын және қанша зат сатып алғысы келетінін сұраңыз.
// Егер заттың жалпы құны:
// 5000-нан асса, 10% жеңілдік жасалады.
// 10000-нан асса, 20% жеңілдік жасалады.
// 20000-нан асса, 30% жеңілдік жасалады.
// Соңғы төлемді жеңілдікпен есептеп, көрсетіңіз.

// 3. Тапсырма: Пайдаланушыға кездейсоқ сан жасыру

// Қолданушы 1 мен 100 арасында жасырылған санды табуы керек. Әр жорамалда бағдарлама жасырылған санның жақындығы туралы келесі хабарламаларды береді:

// Диапазонға жатса (жасырылған сан ± 5):
// Егер жорамал аз болса → "Сәл жоғары"
// Егер жорамал көп болса → "Сәл төмен"


// Диапазоннан тыс болса (жасырылған сан ± 5-тен үлкен айырмашылық):
// Егер жорамал аз болса → "Жай жоғары"
// Егер жорамал көп болса → "Жай төмен"


// Шарттар:
// Жасырылған сан кездейсоқ түрде 1 мен 100 аралығында таңдалады.
// Қолданушыдан болжам сұрау үшін цикл қолданылады.
// Жауаптар диапазонға қатысты нақты бағытты көрсетеді.
// Жасырылған сан табылған кезде, дұрыс жауап туралы хабарланады, және қанша әрекет жасалғаны көрсетіледі.
// Жұмыстарыңызды GitHub-қа салып сілтемесін жүктейміз!
